99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_wps/esp32_mquickjs_wifi_wps_ap.c
#include "esp32_mquickjs_wifi_wps_ap.h"
#include "esp32_mquickjs_memory.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
#include "esp32_mquickjs_wifi_wps_ap_session.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include <stdio.h>
#include <string.h>

typedef enum { WPS_RECEIVE, WPS_CLOSE } wps_operation_t;
typedef struct {
    esp_wps_config_t config;
    uint32_t timeout_ms;
} wps_options_t;
struct esp32_mquickjs_future_driver_state {
    esp32_mquickjs_wifi_wps_ap_session_t *session;
    wps_operation_t operation;
    uint32_t timeout_ms;
    int64_t deadline_us;
    bool started, cancelled, wait_timed_out, observation_registered;
};
#define SET(object, name, value) do { if (!esp32_mquickjs_set_property_ref(ctx, object, name, value)) goto fail; } while (0)

static esp32_mquickjs_wifi_wps_ap_session_t *wps_receiver(JSContext *ctx, JSValue value)
{
    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_WPS_AP_SESSION) {
        JS_ThrowTypeError(ctx, "expected WiFiWpsAPSession"); return NULL;
    }
    esp32_mquickjs_wifi_wps_ap_session_t *session = JS_GetOpaque(ctx, value);
    if (!session) JS_ThrowReferenceError(ctx, "invalid WiFiWpsAPSession");
    return session;
}
void js_wifi_wps_ap_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    /* Pending Future references keep the session alive. The registry requests
     * close when the final external reference, including those Futures, drops. */
    esp32_mquickjs_wifi_wps_ap_session_release(opaque);
}
JSValue js_wifi_wps_ap_constructor(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "use wifi.wps.startAP()");
}
static JSValue wps_identity(JSContext *ctx, uint64_t identity)
{
    if (!identity) return JS_NULL;
    JSGCRef ref;
    JSValue *value = JS_PushGCRef(ctx, &ref);
    *value = JS_NewObject(ctx);
    if (JS_IsException(*value)) goto fail;
    SET(value, "low", JS_NewUint32(ctx, (uint32_t)identity));
    SET(value, "high", JS_NewUint32(ctx, (uint32_t)(identity >> 32)));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
static JSValue wps_status_to_js(JSContext *ctx, const esp32_mquickjs_wifi_wps_ap_session_status_t *s)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "state", JS_NewString(ctx, s->closing ? s->retired ? "closed" : "closing" :
        s->error ? "faulted" : s->result_consumed ? "consumed" : s->result_ready ? "registered" :
        s->pin_ready ? "pin-ready" : s->native.worker.native.started ? "negotiating" : "opening"));
    SET(result, "operation", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.identity) : JS_NULL);
    SET(result, "radioGeneration", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.generation) : JS_NULL);
    SET(result, "nativeIdentity", wps_identity(ctx, s->native.worker.native.identity));
    SET(result, "workerBusy", JS_NewBool(s->worker_busy));
    SET(result, "driverStarted", JS_NewBool(s->native.worker.native.started));
    SET(result, "terminalSeen", JS_NewBool(s->native.worker.native.terminal));
    SET(result, "pinReady", JS_NewBool(s->pin_ready && !s->closing && !s->pin_consumed));
    SET(result, "pinConsumed", JS_NewBool(s->pin_consumed));
    SET(result, "resultReady", JS_NewBool(s->result_ready && !s->closing && !s->result_consumed));
    SET(result, "resultConsumed", JS_NewBool(s->result_consumed));
    SET(result, "captureFinished", JS_NewBool(s->capture_finished));
    SET(result, "nativeClosed", JS_NewBool(s->native_closed));
    SET(result, "helperDrained", JS_NewBool(s->helper_drained));
    SET(result, "eventFenced", JS_NewBool(s->native.event_fenced));
    SET(result, "closeRequested", JS_NewBool(s->closing));
    SET(result, "cleanupPending", JS_NewBool(s->closing && !s->retired));
    SET(result, "timedOut", JS_NewBool(s->timed_out));
    SET(result, "handoffUnknown", JS_NewBool(s->native.worker.handoff_unknown));
    SET(result, "trackingFault", JS_NewBool(s->native.worker.native.tracking_fault));
    SET(result, "eventId", JS_NewInt32(ctx, s->native.worker.native.event_id));
    SET(result, "failureReason", JS_NewInt32(ctx, s->native.worker.native.failure_reason));
    SET(result, "nativeCleanupStage", JS_NewInt32(ctx, s->native.worker.native.cleanup_stage));
    SET(result, "reservedBytes", JS_NewUint32(ctx, s->reserved_bytes));
    SET(result, "error", s->error ? JS_NewInt32(ctx, s->error) : JS_NULL);
    SET(result, "stage", s->stage ? JS_NewString(ctx, s->stage) : JS_NULL);
    SET(result, "cleanupError", s->cleanup_error ? JS_NewInt32(ctx, s->cleanup_error) : JS_NULL);
    SET(result, "cleanupStage", s->cleanup_stage ? JS_NewString(ctx, s->cleanup_stage) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
#define WPS_WATCH_HANDLES 4U
#define WPS_WATCH_CAPACITY 16U
typedef struct {
    uint32_t sequence;
    esp32_mquickjs_wifi_wps_ap_session_status_t status;
} wps_watch_event_t;
typedef struct {
    esp32_mquickjs_event_queue_t *queue;
    esp32_mquickjs_wifi_wps_ap_session_t *session;
    wps_watch_event_t last;
    bool context_bound;
} wps_watch_source_t;
static portMUX_TYPE s_wps_watch_lock = portMUX_INITIALIZER_UNLOCKED;
static wps_watch_source_t *s_wps_watch_sources[WPS_WATCH_HANDLES];
static unsigned s_wps_watch_handles;

/* Compare semantic fields, never padding or the transient worker-busy bit.
 * Every queued pointer is a framework stage string with static lifetime. */
static bool wps_watch_same(const esp32_mquickjs_wifi_wps_ap_session_status_t *a,
    const esp32_mquickjs_wifi_wps_ap_session_status_t *b)
{
#define SAME(field) if (a->field != b->field) return false
    SAME(error);
    SAME(cleanup_error);
    SAME(stage);
    SAME(cleanup_stage);
    SAME(pin_ready);
    SAME(pin_consumed);
    SAME(result_ready);
    SAME(result_consumed);
    SAME(closing);
    SAME(retired);
    SAME(timed_out);
    SAME(capture_finished);
    SAME(native_closed);
    SAME(helper_drained);
    SAME(native.operation.identity);
    SAME(native.operation.generation);
    SAME(native.worker.native.identity);
    SAME(native.worker.native.started);
    SAME(native.worker.native.terminal);
    SAME(native.worker.native.tracking_fault);
    SAME(native.worker.native.event_id);
    SAME(native.worker.native.failure_reason);
    SAME(native.worker.native.cleanup_stage);
    SAME(native.worker.handoff_unknown);
    SAME(native.event_fenced);
#undef SAME
    return true;
}

static void wps_watch_closed(void *opaque)
{
    wps_watch_source_t *source = opaque;
    portENTER_CRITICAL(&s_wps_watch_lock);
    for (unsigned i = 0; i < WPS_WATCH_HANDLES; ++i)
        if (s_wps_watch_sources[i] == source) s_wps_watch_sources[i] = NULL;
    esp32_mquickjs_wifi_wps_ap_session_t *session = source->session;
    source->session = NULL;
    bool bound = source->context_bound;
    if (!bound) --s_wps_watch_handles;
    portEXIT_CRITICAL(&s_wps_watch_lock);
    if (session) esp32_mquickjs_wifi_wps_ap_session_release(session);
    /* Only a private queue construction failure uses this path. No receiver
     * or producer has seen it; its deferred close owns the failed context. */
    if (!bound) esp32_mquickjs_memory_payload_free(source);
}

static void wps_watch_destroyed(void *opaque)
{
    portENTER_CRITICAL(&s_wps_watch_lock);
    --s_wps_watch_handles;
    portEXIT_CRITICAL(&s_wps_watch_lock);
    esp32_mquickjs_memory_payload_free(opaque); /* Budget survives close until queue storage dies. */
}

static JSValue wps_watch_to_js(JSContext *ctx, const void *data, void *opaque)
{
    (void)opaque;
    const wps_watch_event_t *event = data;
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "sequence", JS_NewUint32(ctx, event->sequence));
    SET(result, "status", wps_status_to_js(ctx, &event->status));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

