99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_wps/esp32_mquickjs_wifi_wps_ap.c
static JSValue wps_pin_to_js(JSContext *ctx, esp32_mquickjs_wifi_wps_ap_session_t *session)
{
    uint8_t pin[8] = {0};
    esp_err_t error = esp32_mquickjs_wifi_wps_ap_session_pin(session, pin, false);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    if (error != ESP_OK) { (void)wps_error(ctx, "WiFiWpsAPSession.receive", session, error, false); goto fail; }
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "type", JS_NewString(ctx, "pin"));
    SET(result, "pin", JS_NewStringLen(ctx, (const char *)pin, sizeof(pin)));
    error = esp32_mquickjs_wifi_wps_ap_session_pin(session, NULL, true);
    if (error != ESP_OK) { (void)wps_error(ctx, "WiFiWpsAPSession.receive", session, error, false); goto fail; }
    esp32_mquickjs_wireless_secure_zero(pin, sizeof(pin));
    return JS_PopGCRef(ctx, &ref);
fail:
    esp32_mquickjs_wireless_secure_zero(pin, sizeof(pin));
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

static JSValue wps_registered_to_js(JSContext *ctx, esp32_mquickjs_wifi_wps_ap_session_t *session)
{
    uint8_t peer[6] = {0};
    esp_err_t error = esp32_mquickjs_wifi_wps_ap_session_registered(session, peer, false);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    if (error != ESP_OK) { (void)wps_error(ctx, "WiFiWpsAPSession.receive", session, error, false); goto fail; }
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "type", JS_NewString(ctx, "registered"));
    char address[18];
    snprintf(address, sizeof(address), "%02x:%02x:%02x:%02x:%02x:%02x",
        peer[0], peer[1], peer[2], peer[3], peer[4], peer[5]);
    SET(result, "mac", JS_NewString(ctx, address));
    error = esp32_mquickjs_wifi_wps_ap_session_registered(session, NULL, true);
    if (error != ESP_OK) { (void)wps_error(ctx, "WiFiWpsAPSession.receive", session, error, false); goto fail; }
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

static const char *wps_operation_name(wps_operation_t operation)
{ return operation == WPS_RECEIVE ? "WiFiWpsAPSession.receive" : "WiFiWpsAPSession.close"; }
static void wps_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (!state) return;
    if (state->observation_registered)
        esp32_mquickjs_wifi_wps_ap_session_wait_end(state->session, state->operation == WPS_CLOSE);
    esp32_mquickjs_wifi_wps_ap_session_release(state->session);
    esp32_mquickjs_memory_payload_free(state);
}
static bool wps_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out, wps_operation_t operation)
{
    *out = NULL;
    if (argc > 1) { JS_ThrowTypeError(ctx, "Wps method expects optional timeout options"); return false; }
    esp32_mquickjs_wifi_wps_ap_session_t *session = wps_receiver(ctx, self->val);
    if (!session) return false;
    if (!esp32_mquickjs_wifi_wps_ap_session_retain(session)) { JS_ThrowInternalError(ctx, "Wps reference exhausted"); return false; }
    bool valid = true;
    uint32_t timeout = 1000;
    if (argc && !JS_IsUndefined(argv[0].val)) {
        static const char *const keys[] = {"timeoutMs"};
        valid = esp32_mquickjs_validate_plain_options(ctx, argv[0].val, wps_operation_name(operation), keys, 1);
        if (valid) {
            JSGCRef ref;
            JSValue *field = JS_PushGCRef(ctx, &ref);
            *field = JS_GetPropertyStr(ctx, argv[0].val, "timeoutMs");
            valid = !JS_IsException(*field) && (JS_IsUndefined(*field) ||
                esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 3600000, &timeout));
            JS_PopGCRef(ctx, &ref);
        }
    }
    if (!valid) {
        esp32_mquickjs_wifi_wps_ap_session_release(session);
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid Wps timeout options");
        return false;
    }
    esp32_mquickjs_future_driver_state_t *state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (!state) { esp32_mquickjs_wifi_wps_ap_session_release(session); JS_ThrowOutOfMemory(ctx); return false; }
    state->session = session; state->operation = operation; state->timeout_ms = timeout;
    if (!esp32_mquickjs_wifi_wps_ap_session_wait_begin(session, operation == WPS_CLOSE)) {
        wps_destroy(state); JS_ThrowInternalError(ctx, "Wps waiter count exhausted"); return false;
    }
    state->observation_registered = true;
    *out = state; return true;
}
static bool wps_receive_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return wps_capture(ctx, self, argc, argv, out, WPS_RECEIVE); }
static bool wps_close_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return wps_capture(ctx, self, argc, argv, out, WPS_CLOSE); }
static bool wps_start(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token, esp32_mquickjs_future_driver_state_t *state)
{
    (void)runtime; (void)token;
    int64_t now = esp_timer_get_time(), duration = (int64_t)state->timeout_ms * 1000;
    if (now < 0 || now > INT64_MAX - duration) { JS_ThrowInternalError(ctx, "Wps clock exhausted"); return false; }
    state->started = true; state->deadline_us = now + duration;
    if (state->operation == WPS_CLOSE) esp32_mquickjs_wifi_wps_ap_session_close(state->session, false);
    (void)esp32_mquickjs_wifi_wps_ap_service();
    return true;
}
static esp32_mquickjs_future_poll_t wps_poll(esp32_mquickjs_future_driver_state_t *state)
{
    if (state->cancelled) return ESP32_MQUICKJS_FUTURE_READY;
    (void)esp32_mquickjs_wifi_wps_ap_service();
    esp32_mquickjs_wifi_wps_ap_session_status_t status;
    (void)esp32_mquickjs_wifi_wps_ap_session_status(state->session, &status);
    bool ready = state->operation == WPS_CLOSE ? status.retired : status.error || status.closing ||
        status.result_consumed || ((status.pin_ready || status.result_ready) && !status.worker_busy);
    if (!ready && state->operation == WPS_RECEIVE && esp_timer_get_time() >= state->deadline_us) {
        state->wait_timed_out = true; ready = true;
    }
    return ready ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
}
static JSValue wps_finish(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->operation == WPS_CLOSE) return JS_UNDEFINED;
    if (state->wait_timed_out) return JS_NULL;
    esp32_mquickjs_wifi_wps_ap_session_status_t status;
    (void)esp32_mquickjs_wifi_wps_ap_session_status(state->session, &status);
    if (status.error || status.closing) return wps_error(ctx, wps_operation_name(state->operation), state->session, ESP_OK, false);
    if (status.pin_ready && !status.pin_consumed) return wps_pin_to_js(ctx, state->session);
    if (status.result_consumed) return JS_ThrowReferenceError(ctx, "WPS registration already consumed");
    return wps_registered_to_js(ctx, state->session);
}
static esp32_mquickjs_cancel_result_t wps_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    state->cancelled = true;
    /* receive cancellation changes no native intent. Started close is already
     * retained by the registry; cancellation before start must not close. */
    return ESP32_MQUICKJS_CANCELLED;
}
static uint32_t wps_timeout(const esp32_mquickjs_future_driver_state_t *state)
{ return state->operation == WPS_RECEIVE ? 0U : state->timeout_ms; }
static JSValue wps_on_timeout(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state, uint32_t timeout_ms)
{
    (void)timeout_ms;
    (void)wps_cancel(state);
    return wps_error(ctx, wps_operation_name(state->operation), state->session, ESP_ERR_TIMEOUT, true);
}
#define WPS_DRIVER(capture_fn) { .memory_owner = "wireless.future", .capture = capture_fn, .start = wps_start, .poll = wps_poll, .finish = wps_finish, \
    .cancel = wps_cancel, .destroy = wps_destroy, .timeout_ms = wps_timeout, .on_timeout = wps_on_timeout }
static const esp32_mquickjs_future_driver_t s_wps_receive_driver = WPS_DRIVER(wps_receive_capture);
static const esp32_mquickjs_future_driver_t s_wps_close_driver = WPS_DRIVER(wps_close_capture);
static JSValue wps_call(JSContext *ctx, JSValue *receiver, int argc, JSValue *argv, const char *name)
{
    JSGCRef self_ref, method_ref;
    JSValue *self = JS_PushGCRef(ctx, &self_ref), *method = JS_PushGCRef(ctx, &method_ref);
    *self = *receiver; *method = JS_GetPropertyStr(ctx, *self, name);
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(ctx,
        esp32_mquickjs_get_active_runtime(), *method, *self, argc, argv);
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &self_ref); return result;
}
JSValue js_wifi_wps_ap_cancel(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "WPS cancel expects no arguments");
    esp32_mquickjs_wifi_wps_ap_session_t *session = wps_receiver(ctx, *self);
    if (!session) return JS_EXCEPTION;
    esp32_mquickjs_wifi_wps_ap_session_close(session, false);
    (void)esp32_mquickjs_wifi_wps_ap_service();
    return JS_UNDEFINED;
}
JSValue js_wifi_wps_ap_receive(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return wps_call(ctx, self, argc, argv, "receive"); }
JSValue js_wifi_wps_ap_close(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return wps_call(ctx, self, argc, argv, "close"); }
bool esp32_mquickjs_init_wifi_wps_ap_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, object_ref, proto_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *proto = JS_PushGCRef(ctx, &proto_ref), *method = JS_PushGCRef(ctx, &method_ref);
    bool ok = false;
    *global = JS_GetGlobalObject(ctx);
    if (JS_IsException(*global)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "WiFiWpsAPSession");
    if (JS_IsException(*object)) goto done;
    *proto = JS_GetPropertyStr(ctx, *object, "prototype");
    if (JS_IsException(*proto)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "receive");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_wps_receive_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_wps_close_driver)) goto done;
    ok = true;
done:
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register Wps runtime");
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &proto_ref); JS_PopGCRef(ctx, &object_ref); JS_PopGCRef(ctx, &global_ref);
    return ok;
}
#endif
